In [1]:
# การใช้งาน Pandas เบื้องต้น
'''
1. เปิดไฟล์กึ่งโครงสร้าง CSV
2. การดูรายละเอียดของไฟล์
3. การบันทึกไฟล์
'''

import pandas as pd

In [3]:
pd.__version__

'1.0.1'

In [4]:
# None Structure : Plain Text คือ ไฟล์เอกสารที่ไม่มีการจัดรูปแบบ (None Format) -- มีแต่ข้อความ *.txt
# Semi-Structure : JSON, CSV
# Structure : Database, Excel

In [5]:
'''
Relational Database : 
NoSQL : 

student_table

id : int
std_code : varchar(255) - not null
first_name : varchar(255) - not null
last_name : varchar(255) - not null
faculty : int - not null


# NoSQL
    -- Document base
        -- stuents
            -1 -- id, std_code, first_name, last_name
            -2 -- id, first_name, last_name
            -3 -- first_name, last_name, major
            -4 -- id, first_name, last_name, imgs
            
            
Pandas 
 - การจัดการ Structure data
 - แปลงข้อมูลที่ไม่มีโครงสร้าง --> มีโครงสร้าง --> ใช้ Pandas จัดการ
 
'''

'\nRelational Database : \n\n'

In [6]:
data = pd.read_csv("./data/ข้อมูลวัด.csv")

In [9]:
# Data Frame Object
data.head(2)

,อันดับ,ชื่อ,Unnamed: 2,Unnamed: 3,พระเกจิ,Unnamed: 5,รายละเอียด,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,ละติจูด,ลองติจูด
0,1,วัดสว่างอารมณ์,NaN,NaN,รอข้อมูล,NaN,ตำบล คูซอด อำเภอเมืองศรีสะเกษ ศรีสะเกษ 33000,NaN,NaN,NaN,NaN,15.191689,104.277227
1,2,วัดโนนแดง,NaN,NaN,รอข้อมูล,NaN,ตำบล หนองไผ่ อำเภอเมืองศรีสะเกษ ศรีสะเกษ 33000,NaN,NaN,NaN,NaN,15.124654,104.289223

In [11]:
data.tail(2)

,อันดับ,ชื่อ,Unnamed: 2,Unnamed: 3,พระเกจิ,Unnamed: 5,รายละเอียด,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,ละติจูด,ลองติจูด
48,49,วัดมหาพุทธาราม (วัดพระโต),NaN,NaN,รอข้อมูล,NaN,วัดมหาพุทธาราม บ้านเมืองเหนือ อำเภอเมืองศรีสะเ...,NaN,NaN,NaN,NaN,15.117703,104.326558
49,50,วัดพระธาตุสุพรรณหงส์,NaN,NaN,รอข้อมูล,NaN,พระธาตุสุพรรณหงส์ บ้านหว้าน ต.น้ำคำ อ.เมือง จ....,NaN,NaN,NaN,NaN,15.194201,104.294009

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   อันดับ       50 non-null     int64
 1   ชื่อ         50 non-null     object
 2   Unnamed: 2   0 non-null      float64
 3   Unnamed: 3   0 non-null      float64
 4   พระเกจิ      50 non-null     object
 5   Unnamed: 5   0 non-null      float64
 6   รายละเอียด   50 non-null     object
 7   Unnamed: 7   0 non-null      float64
 8   Unnamed: 8   0 non-null      float64
 9   Unnamed: 9   0 non-null      float64
 10  Unnamed: 10  0 non-null      float64
 11  ละติจูด      50 non-null     float64
 12  ลองติจูด     50 non-null     float64
dtypes: float64(9), int64(1), object(3)
memory usage: 5.2+ KB

In [13]:
new_data = data[["อันดับ", "ชื่อ", "พระเกจิ", "รายละเอียด", "ละติจูด", "ลองติจูด"]]

In [14]:
new_data.head()

,อันดับ,ชื่อ,พระเกจิ,รายละเอียด,ละติจูด,ลองติจูด
0,1,วัดสว่างอารมณ์,รอข้อมูล,ตำบล คูซอด อำเภอเมืองศรีสะเกษ ศรีสะเกษ 33000,15.191689,104.277227
1,2,วัดโนนแดง,รอข้อมูล,ตำบล หนองไผ่ อำเภอเมืองศรีสะเกษ ศรีสะเกษ 33000,15.124654,104.289223
2,3,วัดยางชุมใหญ่,รอข้อมูล,"หมู่ 1, ตําบลยางชุมใหญ่ อําเภอยางชุมน้อย จังห...",15.221466,104.408265
3,4,วัดบ้านบัวน้อย,รอข้อมูล,ต.บัวน้อย อ.กันทรารมย์ จ.ศรีสะเกษ 33130,15.157435,104.491364
4,5,วัดบ้านกระแชงใหญ่,รอข้อมูล,เป็นวัดประจำหมู่บ้าน เจ้าอาวาสเป็นเจ้าคณะตำบล ...,14.658167,104.584000

In [15]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   อันดับ      50 non-null     int64
 1   ชื่อ        50 non-null     object
 2   พระเกจิ     50 non-null     object
 3   รายละเอียด  50 non-null     object
 4   ละติจูด     50 non-null     float64
 5   ลองติจูด    50 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 2.5+ KB

In [17]:
new_data.to_csv("./data/ข้อมูลวัดใหม่.csv")

In [18]:
new_data.to_excel("./data/ข้อมูลวัดใหม่.xlsx")

In [28]:
new_data[["ละติจูด", "ลองติจูด"]].head()

     ละติจูด    ลองติจูด
0  15.191689  104.277227
1  15.124654  104.289223
2  15.221466  104.408265
3  15.157435  104.491364
4  14.658167  104.584000

In [29]:
# การสร้าง Data Frame จากชุดข้อมูล

# ข้อมูลบุคคล 3 คน
# นายพิศาล สุขขี 0842982456
# นายปรเมษฐ สุขตะ 0889152456
# นายสมชาย รักดี 0886123546

persons = {
    "ชื่อ": ["พิศาล", "ปรเมษฐ", "สมชาย"],
    "สกุล": ["สุขขี", "สุขะตะ", "รักดี"],
    "โทร": ["0842982456", "0889152456", "0886123546"]
}

In [33]:
data = pd.DataFrame(persons)
data.head()

     ชื่อ    สกุล         โทร
0   พิศาล   สุขขี  0842982456
1  ปรเมษฐ  สุขะตะ  0889152456
2   สมชาย   รักดี  0886123546

In [34]:
data[["โทร"]]

          โทร
0  0842982456
1  0889152456
2  0886123546

In [35]:
data

     ชื่อ    สกุล         โทร
0   พิศาล   สุขขี  0842982456
1  ปรเมษฐ  สุขะตะ  0889152456
2   สมชาย   รักดี  0886123546

In [41]:
# ในกรณีที่เรารู้ index
data.iloc[2]['โทร']

'0886123546'

In [61]:
# ในกรณีที่เราไม่รู้ index
tel = data[data["ชื่อ"]=='ปรเมษฐ']

In [62]:
tel

     ชื่อ    สกุล         โทร
1  ปรเมษฐ  สุขะตะ  0889152456

In [ ]:
# คิว
'''
รับข้อมูลจากผู้ใช้ผ่านคีย์บอร์ด
ถ้าผู้ใช้ป้อนข้อมูลใด ๆ ให้นำข้อมูลนั้นมาเก็บไว้ในคิว
แต่ถ้าป้อนตัว d : ให้นำข้อมูลตัวแรกออกจาคิว
ถ้าป้อนตัว x: ให้โปรแกรมหยุดทำงาน
'''

q = []
data = input("Enter data : ")
while data != "x":
    if data != "d":
        q.insert(0, data)
    else:
        if q == []:
            print("Queue is empty")
        else:
            print(q.pop())
        
    data = input("Enter data : ")

Enter data :  d

Queue is empty

Enter data :  1
Enter data :  2
Enter data :  3
Enter data :  4
Enter data :  d

1

Enter data :  d

2

Enter data :  d

3

Enter data :  d

4

Enter data :  d

Queue is empty

Enter data :  d

Queue is empty

Enter data :  1
Enter data :  2
Enter data :  d

1

Enter data :  d

2

Enter data :  d

Queue is empty